In [2]:
import pandas as pd

#### Create Dataframe from scratch

In [3]:
empty_df = pd.DataFrame(columns = ["empty","data","frame"])
len(empty_df)

0

In [4]:
empty_df

Empty DataFrame
Columns: [empty, data, frame]
Index: []

In [5]:
df_from_scratch = pd.DataFrame(
    [["lala",3,["main","makan"]],
     ["lili",2],
     ["lulu",5],
     ["lele",1]
    ], 
    columns=["nama", "kelas","hobi"]
)

In [6]:
df_from_scratch

   nama  kelas           hobi
0  lala      3  [main, makan]
1  lili      2           None
2  lulu      5           None
3  lele      1           None

In [7]:
type(df_from_scratch.hobi[0])

list

In [8]:
student_column = ["nama", "kelas"]

In [9]:
student_data = [
    ["nana", 3],
    ["nini", 2],
    ("nunu", 4)
]
student_df = pd.DataFrame(student_data, columns=student_column)

In [10]:
student_df

   nama  kelas
0  nana      3
1  nini      2
2  nunu      4

In [11]:
nama = ["kaka", "kiki", "keke"]
kelas = [2,5,3]
student_df2 = pd.DataFrame(zip(nama,kelas), columns = student_column)

In [12]:
list1 = ["a","b","c"]
list2 = [1,2,3]
zipped = zip(list1, list2)

In [13]:
for z in zipped:
    print(z)

('a', 1)
('b', 2)
('c', 3)

In [14]:
student_df2

   nama  kelas
0  kaka      2
1  kiki      5
2  keke      3

#### Adding Rows to A Dataframe

In [15]:
print(len(student_df))
student_df = student_df.append(student_df2, ignore_index=True)
print(len(student_df))
student_df

3
6

   nama  kelas
0  nana      3
1  nini      2
2  nunu      4
3  kaka      2
4  kiki      5
5  keke      3

In [16]:
student_df = student_df.append(
    {"nama": "Tuti", "kelas":3},
    ignore_index=True
)

In [17]:
new_students = [["dido",2],["dodi",3],["didi",1]]

print(len(student_df))
for student in new_students:
    student_df = student_df.append(
        {"nama": student[0], "kelas":student[1]},
        ignore_index=True
    )
print(len(student_df))

7
10

In [18]:
student_df

   nama  kelas
0  nana      3
1  nini      2
2  nunu      4
3  kaka      2
4  kiki      5
5  keke      3
6  Tuti      3
7  dido      2
8  dodi      3
9  didi      1

In [19]:
transferred_students = [["caca",4],["ica",3],["oca",6]]
print(len(student_df))
pd.concat(
    [pd.DataFrame(student, columns = ["nama"]) 
     for student in transferred_students],
    ignore_index=True
)
print(len(student_df))
student_df

10
10

   nama  kelas
0  nana      3
1  nini      2
2  nunu      4
3  kaka      2
4  kiki      5
5  keke      3
6  Tuti      3
7  dido      2
8  dodi      3
9  didi      1

#### Adding columns to a Dataframe

In [20]:
student_df

   nama  kelas
0  nana      3
1  nini      2
2  nunu      4
3  kaka      2
4  kiki      5
5  keke      3
6  Tuti      3
7  dido      2
8  dodi      3
9  didi      1

In [21]:
print(student_df.columns)
student_df["nama_sekolah"] = "SDN Gembira Ria"
print(student_df.columns)

Index(['nama', 'kelas'], dtype='object')
Index(['nama', 'kelas', 'nama_sekolah'], dtype='object')

In [22]:
student_df.head(2)

   nama  kelas     nama_sekolah
0  nana      3  SDN Gembira Ria
1  nini      2  SDN Gembira Ria

In [23]:
student_df["usia"] = 0
student_df.head(3)

   nama  kelas     nama_sekolah  usia
0  nana      3  SDN Gembira Ria     0
1  nini      2  SDN Gembira Ria     0
2  nunu      4  SDN Gembira Ria     0

In [24]:
student_df.loc[1,"usia"]

0

In [25]:
for i in range(0, len(student_df)):
    student_df.loc[i,"usia"] = 6 + student_df.loc[i]["kelas"]

In [26]:
for i in range(0, len(student_df)):
    student_df.loc[i,"usia3"] = 6 + student_df.loc[i]["kelas"]

In [27]:
student_df["usia_2"] = student_df["kelas"].apply(
    lambda value_kelas: value_kelas+6
)

In [28]:
student_df

   nama  kelas     nama_sekolah  usia  usia3  usia_2
0  nana      3  SDN Gembira Ria     9    9.0       9
1  nini      2  SDN Gembira Ria     8    8.0       8
2  nunu      4  SDN Gembira Ria    10   10.0      10
3  kaka      2  SDN Gembira Ria     8    8.0       8
4  kiki      5  SDN Gembira Ria    11   11.0      11
5  keke      3  SDN Gembira Ria     9    9.0       9
6  Tuti      3  SDN Gembira Ria     9    9.0       9
7  dido      2  SDN Gembira Ria     8    8.0       8
8  dodi      3  SDN Gembira Ria     9    9.0       9
9  didi      1  SDN Gembira Ria     7    7.0       7

#### Summary of Dataframe

In [29]:
student_df.usia.min()

7

In [30]:
print(max(student_df.nama))
print(student_df.nama.min())

nunu
Tuti

In [31]:
print(max(student_df.usia))
print(student_df.usia.idxmax())
print(student_df.usia.min())
print(student_df.usia.idxmin())
print(student_df.usia.mean())
print(student_df.usia.median())
print(student_df.usia.sum())

11
4
7
9
8.8
9.0
88

#### Sorting

In [32]:
student_df.sort_values(by="usia", ascending=True)

   nama  kelas     nama_sekolah  usia  usia3  usia_2
9  didi      1  SDN Gembira Ria     7    7.0       7
1  nini      2  SDN Gembira Ria     8    8.0       8
3  kaka      2  SDN Gembira Ria     8    8.0       8
7  dido      2  SDN Gembira Ria     8    8.0       8
0  nana      3  SDN Gembira Ria     9    9.0       9
5  keke      3  SDN Gembira Ria     9    9.0       9
6  Tuti      3  SDN Gembira Ria     9    9.0       9
8  dodi      3  SDN Gembira Ria     9    9.0       9
2  nunu      4  SDN Gembira Ria    10   10.0      10
4  kiki      5  SDN Gembira Ria    11   11.0      11

In [33]:
student_df.sort_values(by=["usia","nama"], ascending=[True,False])

   nama  kelas     nama_sekolah  usia  usia3  usia_2
9  didi      1  SDN Gembira Ria     7    7.0       7
1  nini      2  SDN Gembira Ria     8    8.0       8
3  kaka      2  SDN Gembira Ria     8    8.0       8
7  dido      2  SDN Gembira Ria     8    8.0       8
0  nana      3  SDN Gembira Ria     9    9.0       9
5  keke      3  SDN Gembira Ria     9    9.0       9
8  dodi      3  SDN Gembira Ria     9    9.0       9
6  Tuti      3  SDN Gembira Ria     9    9.0       9
2  nunu      4  SDN Gembira Ria    10   10.0      10
4  kiki      5  SDN Gembira Ria    11   11.0      11

#### Slicing & Where Selection

In [34]:
student_df["usia"]

0     9
1     8
2    10
3     8
4    11
5     9
6     9
7     8
8     9
9     7
Name: usia, dtype: int64

In [35]:
student_df[student_df["usia"] == 8]

   nama  kelas     nama_sekolah  usia  usia3  usia_2
1  nini      2  SDN Gembira Ria     8    8.0       8
3  kaka      2  SDN Gembira Ria     8    8.0       8
7  dido      2  SDN Gembira Ria     8    8.0       8

In [36]:
aaa = student_df.where(student_df["usia"] == 9)

In [37]:
student_df.where(student_df["usia"] == 9)

   nama  kelas     nama_sekolah  usia  usia3  usia_2
0  nana    3.0  SDN Gembira Ria   9.0    9.0     9.0
1   NaN    NaN              NaN   NaN    NaN     NaN
2   NaN    NaN              NaN   NaN    NaN     NaN
3   NaN    NaN              NaN   NaN    NaN     NaN
4   NaN    NaN              NaN   NaN    NaN     NaN
5  keke    3.0  SDN Gembira Ria   9.0    9.0     9.0
6  Tuti    3.0  SDN Gembira Ria   9.0    9.0     9.0
7   NaN    NaN              NaN   NaN    NaN     NaN
8  dodi    3.0  SDN Gembira Ria   9.0    9.0     9.0
9   NaN    NaN              NaN   NaN    NaN     NaN

#### Grouping

In [38]:
student_df.groupby("kelas").mean()

       usia  usia3  usia_2
kelas
1         7    7.0       7
2         8    8.0       8
3         9    9.0       9
4        10   10.0      10
5        11   11.0      11

In [39]:
student_df.columns

Index(['nama', 'kelas', 'nama_sekolah', 'usia', 'usia3', 'usia_2'], dtype='object')

In [40]:
student_df.groupby(["kelas", "usia"]).mean()

            usia3  usia_2
kelas usia
1     7       7.0       7
2     8       8.0       8
3     9       9.0       9
4     10     10.0      10
5     11     11.0      11

In [41]:
student_df.groupby(["kelas"]).sum()

       usia  usia3  usia_2
kelas
1         7    7.0       7
2        24   24.0      24
3        36   36.0      36
4        10   10.0      10
5        11   11.0      11

In [42]:
student_df[["kelas", "usia"]].groupby(["kelas"]).sum()

       usia
kelas
1         7
2        24
3        36
4        10
5        11

In [43]:
student_df.groupby(["kelas"]).count()

       nama  nama_sekolah  usia  usia3  usia_2
kelas
1         1             1     1      1       1
2         3             3     3      3       3
3         4             4     4      4       4
4         1             1     1      1       1
5         1             1     1      1       1

In [44]:
student_df[["kelas", "usia"]].groupby(["kelas"]).count()

       usia
kelas
1         1
2         3
3         4
4         1
5         1

In [45]:
student_df.groupby(["kelas"]).nama.unique()

kelas
1                      [didi]
2          [nini, kaka, dido]
3    [nana, keke, Tuti, dodi]
4                      [nunu]
5                      [kiki]
Name: nama, dtype: object

In [46]:
student_df.groupby(["kelas"]).nama.nunique()

kelas
1    1
2    3
3    4
4    1
5    1
Name: nama, dtype: int64

In [47]:
student_df.append(
    pd.DataFrame([["lulu",3],["lolo",2]],columns=["nama","kelas"]),
    ignore_index = True
)

C:\Users\user only\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

    kelas  nama     nama_sekolah  usia  usia3  usia_2
0       3  nana  SDN Gembira Ria   9.0    9.0     9.0
1       2  nini  SDN Gembira Ria   8.0    8.0     8.0
2       4  nunu  SDN Gembira Ria  10.0   10.0    10.0
3       2  kaka  SDN Gembira Ria   8.0    8.0     8.0
4       5  kiki  SDN Gembira Ria  11.0   11.0    11.0
5       3  keke  SDN Gembira Ria   9.0    9.0     9.0
6       3  Tuti  SDN Gembira Ria   9.0    9.0     9.0
7       2  dido  SDN Gembira Ria   8.0    8.0     8.0
8       3  dodi  SDN Gembira Ria   9.0    9.0     9.0
9       1  didi  SDN Gembira Ria   7.0    7.0     7.0
10      3  lulu              NaN   NaN    NaN     NaN
11      2  lolo              NaN   NaN    NaN     NaN

#### null values

In [48]:
null_student = pd.DataFrame(
    [["lala"]], 
    columns=["nama"]
)

In [49]:
student_df = student_df.append(null_student, ignore_index=True)

In [50]:
len(student_df)

11

In [51]:
no_nan_value = student_df.dropna()

In [52]:
filled_student_df = student_df.fillna(7)

In [225]:
len(no_nan_value)

13